# loc e iloc

In [2]:
import pandas as pd

In [3]:
dados = {'A': [12, 15, 17, 19],
        'B': [11, 23, 34, 4],
         'C': [90, 22, 33, 31]
        }
df = pd.DataFrame(dados, index = ['a', 'b', 'c', 'd'])

In [4]:
df

    A   B   C
a  12  11  90
b  15  23  22
c  17  34  33
d  19   4  31

In [5]:
df.loc['a']

A    12
B    11
C    90
Name: a, dtype: int64

In [6]:
df.loc['a': 'b']

    A   B   C
a  12  11  90
b  15  23  22

In [7]:
df.loc['a': 'b', "A"]

a    12
b    15
Name: A, dtype: int64

In [8]:
df.loc['a': 'c', 'A':'B']

    A   B
a  12  11
b  15  23
c  17  34

In [9]:
df['A'].loc[df['A']>=15]

b    15
c    17
d    19
Name: A, dtype: int64

In [10]:
df.loc[df['A']>=17]

    A   B   C
c  17  34  33
d  19   4  31

In [11]:
df.loc[(df['A']>=17) & (df['B']>=34)] # E

    A   B   C
c  17  34  33

In [12]:
df.loc[(df['A']>=17) | (df['B']>=34)] # ou

    A   B   C
c  17  34  33
d  19   4  31

In [13]:
df

    A   B   C
a  12  11  90
b  15  23  22
c  17  34  33
d  19   4  31

In [14]:
df.iloc[0]

A    12
B    11
C    90
Name: a, dtype: int64

In [15]:
df.iloc[0:1]

    A   B   C
a  12  11  90

In [16]:
df.iloc[0:2]

    A   B   C
a  12  11  90
b  15  23  22

In [17]:
df.iloc[:2]

    A   B   C
a  12  11  90
b  15  23  22

In [18]:
df.iloc[2:4]

    A   B   C
c  17  34  33
d  19   4  31

In [19]:
df.iloc[1:4]

    A   B   C
b  15  23  22
c  17  34  33
d  19   4  31

In [20]:
df.iloc[:4]

    A   B   C
a  12  11  90
b  15  23  22
c  17  34  33
d  19   4  31

In [21]:
df.iloc[1:]

    A   B   C
b  15  23  22
c  17  34  33
d  19   4  31

In [22]:
df.iloc[1, 0]

15

In [23]:
df.iloc[0, 0]

12

In [24]:
df.iloc[3, 0]

19

In [25]:
df.iloc[3,2]

31

In [26]:
df.iloc[1,:]

A    15
B    23
C    22
Name: b, dtype: int64

In [27]:
df.iloc[2,0] + [3,5]

array([20, 22])